tutorials/multiphase/compressibleInterFoam/les/depthCharge2D/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=`getApplication`

runApplication blockMesh
cp 0/alpha1.org 0/alpha1
cp 0/p_rgh.org 0/p_rgh
runApplication setFields
runApplication $application

# ----------------------------------------------------------------- end-of-file
