tutorials/multiphase/compressibleInterFoam/les/depthCharge2D/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha1 1
    volScalarFieldValue p_rgh 1e5
);

regions
(
    sphereToCell
    {
        centre (0.5 0.5 0);
        radius 0.1;
        fieldValues
        (
            volScalarFieldValue alpha1 0
            volScalarFieldValue p_rgh 1e6
        );
    }
    boxToCell
    {
        box (-10 1 -1) (10 10 1);
        fieldValues
        (
            volScalarFieldValue alpha1 0
        );
    }
);


// ************************************************************************* //
